//Завдання 2: Конкатенація радків та шаблонний рядок
//Створіть дві змінні, які містять імена двох осіб. Використовуючи конкатенацію рядків, створіть новий рядок, який містить вітання для обох осіб. Виведіть результат в консоль. 
//Потім використайте шаблонний рядок для створення того ж вітання. Виведіть результат в консоль.

let user1 = "John";
let user2 = "Jane";
let welcomeMessage = "Hello, " + user1 + " and " + user2 + "!";
console.log(welcomeMessage);

let welcomeMessage2 = `Hello, ${user1} and ${user2}!`;
console.log(welcomeMessage2);
